# St7GetGeometrySize

Retrieves the relative overall size of the geometry in the specified Strand7 model. This size measure is used when
calculating the relative geometry tolerance.

long St7GetGeometrySize(long uID, double* Size)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Size
Relative overall geometry size.

Entities – Load Paths